In [20]:
import numpy as np
import pandas as pd

In [21]:
DATA = {'FName': ['Luffy', 'Zoro', 'Sanji', 'Nami', 'Ussop', 'Chopper', 'Robin'],
        'MName': ['D', '', '', '', '', 'Tony', ''],
        'LName': ['Monkey', 'Roronora', 'Vinsmoke', '', '', 'Tony', 'Nico']}

In [22]:

a = pd.DataFrame(DATA)

In [26]:
a.head()

   FName MName     LName
0  Luffy     D    Monkey
1   Zoro        Roronora
2  Sanji        Vinsmoke
3   Nami
4  Ussop